app/Models/ModelKeuangan.php

SELECT *
FROM `tbl_keuangan`
---
    public function AllData()
    {
        return $this->db->table('tbl_keuangan')->get()->getResultArray();