app/Models/ModelBerita.php

    public function AllDataLimit()
    {
        return $this->db->table('tbl_berita')
            ->limit(10)
            ->orderBy('id_berita', 'DESC')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_berita`
ORDER BY `id_berita` DESC
 LIMIT 10