app/Models/ModelMitra.php

    public function AllData()
    {
        return $this->db->table('tbl_mitra')->get()->getResultArray();
---
SELECT *
FROM `tbl_mitra`