app/Models/ModelGuru.php

SELECT *
FROM `tbl_guru`
ORDER BY `id_guru` DESC
---
    public function AllData()
    {
        return $this->db->table('tbl_guru')
            ->orderBy('id_guru', 'DESC')
            ->get()->getResultArray();