app/Models/ModelKelas.php

SELECT *
FROM `tbl_kelas`
---
    public function AllData()
    {
        return $this->db->table('tbl_kelas')
            ->get()->getResultArray();