app/Models/ModelTahunAjaran.php

    public function AllData()
    {
        return $this->db->table('tbl_ta')->get()->getResultArray();
---
SELECT *
FROM `tbl_ta`