app/Models/ModelSiswa.php

    public function AllData()
    {
        return $this->db->table('tbl_siswa')
            ->join('tbl_jurusan', 'tbl_jurusan.id_jurusan=tbl_siswa.id_jurusan', 'LEFT')
            ->orderBy('id_siswa', 'DESC')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_siswa`
LEFT JOIN `tbl_jurusan` ON `tbl_jurusan`.`id_jurusan`=`tbl_siswa`.`id_jurusan`
ORDER BY `id_siswa` DESC