app/Models/ModelMapel.php

    public function AllData()
    {
        return $this->db->table('tbl_mapel')->get()->getResultArray();
---
SELECT *
FROM `tbl_mapel`

    public function AllDataMatkul($id_jurusan)
    {
        return $this->db->table('tbl_mapel')
            ->where('id_jurusan', $id_jurusan)
            ->orderBy('smt', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_mapel`
WHERE `id_jurusan` = '1'
ORDER BY `smt` ASC