app/Views/v_home.php

SELECT *
FROM `tbl_sekolah`
---
        <div class="container">
          <?php
            $db = \Config\Database::connect();
            $web = $db->table('tbl_sekolah')->get()->getRowArray();

SELECT COUNT(*) AS `numrows` FROM `tbl_jurusan`
SELECT COUNT(*) AS `numrows` FROM `tbl_guru`
SELECT COUNT(*) AS `numrows` FROM `tbl_siswa`
---
        <div class="container">
        <?php
            $db = \Config\Database::connect();
            $jurusan = $db->table('tbl_jurusan')->countAll();
            $guru = $db->table('tbl_guru')->countAll();
            $siswa = $db->table('tbl_siswa')->countAll();