app/Views/v_template_admin.php

SELECT *
FROM `tbl_sekolah`
WHERE `id` = 1
SELECT *
FROM `tbl_jurusan`
SELECT *
FROM `tbl_user`
---

    <?php
        $db = \Config\Database::connect();
        $web = $db->table('tbl_sekolah')->where('id', 1)->get()->getRowArray();
        $jurusan = $db->table('tbl_jurusan')->get()->getResultArray();
        $user = $db->table('tbl_user')->get()->getRowArray();