app/Views/v_template_front_end.php

SELECT *
FROM `tbl_sekolah`
WHERE `id` = 1
SELECT *
FROM `tbl_jurusan`
SELECT *
FROM `tbl_mitra`
---

    <?php
        $db = \Config\Database::connect();
        $web = $db->table('tbl_sekolah')->where('id', 1)->get()->getRowArray();
        $jurusan = $db->table('tbl_jurusan')->get()->getResultArray();
        $mitra = $db->table('tbl_mitra')->get()->getResultArray();